<?php
/**
 * Created by PhpStorm.
 * User: frank
 * Date: 2017/7/26
 * Time: 下午8:03
 */

return [
    'OLD_QUASI_DRIVING_TYPE' => ['A1', 'A2', 'A3', 'B1', 'B2', 'C1', 'C2', 'C3', 'C4', 'C5', 'D', 'E', 'F', 'M', 'N', 'P'],//原准驾车型
    'ID_CARD_TYPE' => [1 => '身份证', 2 => '护照', 3 => '军官证', 4 => '其他'],//证件号
    'BUSINESS_TYPE' => [0 => '初领', 1 => '增驾', 9 => '其他'],//业务类型
    'RECORD_STATUS' => [1 => '未备案', 2 => '已备案'],//学员备案状态
    /****************************指纹信息*****************************/
    'FINGER_TARGET_PERSON_USER' => 1,//学员
    'FINGER_TARGET_PERSON_COACH' => 2,//教练
    'FINGER_TYPE_TRAIN' => 1,//训练类型指纹
    'FINGER_TYPE_EXAM' => 2,//考试类型指纹
    'STUDENT_SOURCE' => [
        1 => '报名点',
        2 => '员工',
        3 => '驾校学员',
        4 => '其他',
    ],
    'VEHICLE_RECORD_STATUS' => [1 => '未备案', 2 => '已备案'],
    'ENDINFO_APPLY_STATUS' => [1 => '未申请', 2 => '已申请'],

    /****************************终端上传图片类型**********************/
    'USER_SIGN' => 17,//学员登录
    'USER_SIGN_OUT' => 18,//学员登出
    'USER_SIGN_TRAIN' => 19,//培训过程中

    /****************************课程编码运管使用****************************/
    'SUBJECT_ONE' => 03,
    'SUBJECT_TWO' => [
        1 => 11,
        2 => 12,
        3 => 13,
    ],
    'SUBJECT_THREE' => [
        4 => 21,
        5 => 29,
        6 => 36,
    ],
    'SUBJECT_FORE' => 48,

    'VEHICLE_TYPE' => [
        'A1' => 01,
        'A2' => 02,
        'A3' => 03,
        'B1' => 11,
        'B2' => 12,
        'C1' => 21,
        'C2' => 22,
        'C3' => 23,
        'C4' => 24,
        'C5' => 25,
        'D' => 31,
        'E' => 32,
        'F' => 33,
        'M' => 41,
        'N' => 42,
        'P' => 43,
    ],
    /****************************国籍****************************/

    'nationality' => ['1' => '中国'],


    /****************************培训项目****************************/
    'train_project' => [
        '11' => '基础驾驶',
        '12' => '场地驾驶',
        '13' => '第二部分综合驾驶及考核',
        '21' => '跟车行驶',
        '22' => '变更车道',
        '23' => '靠边停车',


    ]

];