<?php
return [
    'PAYTYPE' => [
        '1' => [
            'name' => '课时费',
            'id'   => '1',
        ],
        /*'2' => [
            'name' => '补考费',
            'id'   => '2',
        ],*/
        '3' => [
            'name' => '考试费',
            'id'   => '3',
        ],
        '4' => [
            'name' => '报名费',
            'id'   => '4',
        ],
        '5' => [
            'name' => '学员充值',
            'id'   => '5',
        ],
        '7' => [
            'name' => '课时违约费',
            'id'   => '7',
        ],
        '8' => [
            'name' => '套餐退费',
            'id'   => '8',
        ],
        '9' => [
            'name' => '套餐补缴',
            'id'   => '9',
        ],
        '6' => [
            'name' => '其它',
            'id'   => '6',
        ]


    ],
    'PAYMENTMETHOD'=>[
        '1'=>[
            'name' => '现金',
            'id'   => 1,
        ],
        '2'=>[
            'name' => '支付宝',
            'id'   => 2,
        ],
        '3'=>[
            'name' => '微信',
            'id'   => 3,
        ],
        '4'=>[
            'name' => '网银',
            'id'   => 4,
        ],
        '5'=>[
            'name' => '刷卡',
            'id'   => 5,
        ],
        '6'=>[
            'name' => '账户余额',
            'id'   => 6,
        ]

    ]

];
